In [14]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [2]:
train=pd.read_csv('Train.csv')

In [3]:
train.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [5]:
train['parch'].unique()

array([0., 1., 2., 3., 9., 5., 4., 6.])

In [6]:
clean_data=train[['pclass','survived','sex','age','sibsp','fare']]

In [7]:
clean_data.head()

   pclass  survived     sex   age  sibsp    fare
0     3.0       0.0  female   NaN    0.0   7.750
1     2.0       0.0    male  39.0    0.0  26.000
2     2.0       1.0  female  40.0    0.0  13.000
3     3.0       1.0  female  31.0    1.0  20.525
4     3.0       1.0  female   NaN    2.0  23.250

In [8]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   object
 3   age       812 non-null    float64
 4   sibsp     1009 non-null   float64
 5   fare      1008 non-null   float64
dtypes: float64(5), object(1)
memory usage: 47.4+ KB

In [11]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [15]:
clean_data['sex']=le.fit_transform(clean_data['sex'])

In [16]:
clean_data.head()

   pclass  survived  sex   age  sibsp    fare
0     3.0       0.0    0   NaN    0.0   7.750
1     2.0       0.0    1  39.0    0.0  26.000
2     2.0       1.0    0  40.0    0.0  13.000
3     3.0       1.0    0  31.0    1.0  20.525
4     3.0       1.0    0   NaN    2.0  23.250

In [17]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int64
 3   age       812 non-null    float64
 4   sibsp     1009 non-null   float64
 5   fare      1008 non-null   float64
dtypes: float64(5), int64(1)
memory usage: 47.4 KB

#DATA IMPUTATION

In [18]:
clean_data['age']=clean_data['age'].fillna(clean_data['age'].mean())

In [19]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int64
 3   age       1009 non-null   float64
 4   sibsp     1009 non-null   float64
 5   fare      1008 non-null   float64
dtypes: float64(5), int64(1)
memory usage: 47.4 KB

In [20]:
clean_data['fare']=clean_data['fare'].fillna(clean_data['fare'].mean())

In [21]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int64
 3   age       1009 non-null   float64
 4   sibsp     1009 non-null   float64
 5   fare      1009 non-null   float64
dtypes: float64(5), int64(1)
memory usage: 47.4 KB

In [23]:
test=pd.read_csv('Test.csv')
test.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0.0,0.0,PC 17474,26.3875,E25,S,5,NaN,"Brooklyn, NY"
1,3.0,"Sage, Miss. Constance Gladys",female,NaN,8.0,2.0,CA. 2343,69.5500,NaN,S,NaN,NaN,NaN
2,1.0,"Rood, Mr. Hugh Roscoe",male,NaN,0.0,0.0,113767,50.0000,A32,S,NaN,NaN,"Seattle, WA"
3,2.0,"Gillespie, Mr. William Henry",male,34.0,0.0,0.0,12233,13.0000,NaN,S,NaN,NaN,"Vancouver, BC"
4,2.0,"Collander, Mr. Erik Gustaf",male,28.0,0.0,0.0,248740,13.0000,NaN,S,NaN,NaN,"Helsinki, Finland Ashtabula, Ohio"

In [25]:
clean_test_data=test[['pclass','sex','age','sibsp','fare']]

In [26]:
clean_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  300 non-null    float64
 1   sex     300 non-null    object
 2   age     234 non-null    float64
 3   sibsp   300 non-null    float64
 4   fare    300 non-null    float64
dtypes: float64(4), object(1)
memory usage: 11.8+ KB

In [27]:
le=LabelEncoder()
clean_test_data['sex']=le.fit_transform(clean_test_data['sex'])

#DATA IMPUTATION

In [29]:
clean_test_data['age']=clean_test_data['age'].fillna(clean_test_data['age'].mean())

In [30]:
clean_test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  300 non-null    float64
 1   sex     300 non-null    int32
 2   age     300 non-null    float64
 3   sibsp   300 non-null    float64
 4   fare    300 non-null    float64
dtypes: float64(4), int32(1)
memory usage: 10.7 KB

In [31]:
clean_test_data.head()

   pclass  sex        age  sibsp     fare
0     1.0    1  36.000000    0.0  26.3875
1     3.0    0  30.027422    8.0  69.5500
2     1.0    1  30.027422    0.0  50.0000
3     2.0    1  34.000000    0.0  13.0000
4     2.0    1  28.000000    0.0  13.0000

In [70]:
from sklearn.ensemble import RandomForestClassifier
input_cols=['pclass','sex','age','sibsp','fare']
output_cols=['survived']

In [71]:
rf=RandomForestClassifier(n_estimators=10,criterion='entropy',max_depth=5)
model=rf.fit(clean_data[input_cols],clean_data[output_cols])

In [72]:
model.score(clean_data[input_cols],clean_data[output_cols])

0.8245787908820614

#LETS PLAY WITH THE VALUES OF N_ESTIMATORS(NUMBER OF TREES ) TO SEE WHICH IS GIVING HIGHER ACCURACY

In [112]:
from sklearn.model_selection import cross_val_score

In [113]:
accuracy=[]
for i in range(1,50):
    acc=cross_val_score(RandomForestClassifier(n_estimators=i,criterion='entropy',max_depth=5),clean_data[input_cols],clean_data[output_cols],cv=5).mean()
    accuracy.append(acc)

In [114]:
max_n_estmator=accuracy.index(max(accuracy))
max_n_estmator

24

#lets take the number of trees be 25

In [165]:
rf=RandomForestClassifier(n_estimators=25,criterion='entropy',max_depth=5)
model=rf.fit(clean_data[input_cols].values,clean_data[output_cols].values.reshape((-1,1)))
model.score(clean_data[input_cols],clean_data[output_cols])

0.8305252725470763

In [166]:
predictions=model.predict(clean_test_data.values)
predictions=predictions.reshape((-1,1))

In [167]:
index=np.arange(300)
index=index.reshape((-1,1))
final_pred=np.hstack((index,predictions))

In [168]:
pred=pd.DataFrame(final_pred,columns=['Id','survived'])

In [152]:
pred.to_csv('preds.csv',index=False)